<script setup>
import mainLayout from '@/layouts/mainLayout.vue';
import Card from './Card.vue';
import navBar from './navBar.vue';
import Contact from './Contact.vue';
</script>

<template>
  <mainLayout>
    <div class="flex flex-col sm:flex-row">
      <div class="flex justify-end">
        <navBar />
      </div>
      <div class="mb-4 sm:mb-0">
        <img src="../images/image1.png" alt="">
      </div>
      <div class="w-full sm:w-[600px] mt-4 sm:mt-0 sm:ml-4 text-center">
        <div class="mt-40 ml-60 text-center gap-y-4 sm:gap-y-12">
          <p class="font-bold text-4xl sm:text-7xl mb-10 sm:mb-12">
            ლეონარდოს ფუნჯი
          </p>
          <span class="text-lg sm:text-xl">ხელოვნება არასოდეს მთავრდება</span>
        </div>
      </div>
    </div>
    <Card />
    <!-- Div start -->
    <div class="pt-40">
      <div class="flex">
        <div class="lg:w-90">
          <h1 class="pl-[600px] text-4xl font-extrabold mb-20 block ">მხატვრის შესახებ</h1>
          <div class="flex">
            <div class="flex-shrink-0">
              <img src="../images/image1.png" class="object-cover" alt="Image">
            </div>
            <p class="mb-4 pt-20 pl-[100px] block text-lg ml-10">
              ლეონარდო და ვინჩმა, რომელიც დაიბადა ვინჩიში, იტალიაში, 1452 წელს, განასახიერა რენესანსული სულისკვეთება,
              როგორც პოლიმათი. მისმა მხატვრულმა ბრწყინვალებამ შექმნა შედევრები, როგორიცაა "მონა ლიზა" და "ბოლო ვახშამი",
              რომლებიც აჩვენებენ სინათლის, ჩრდილის და პერსპექტივის უბადლო გაგებას. ანატომიაში ჩაღრმავებამ, მისმა დისექციამ
              წარმოადგინა რთული ჩანახატები, რომლებიც ავლენს ადამიანის ფორმის ღრმა კვლევას.

              ლეონარდოს საინჟინრო გამოგონება იყო შორსმიმავალი, ითვალისწინებდა საფრენ აპარატებს, სამხედრო ინოვაციებს და
              არქიტექტურულ დიზაინს. მისი რვეულები, იდეებისა და დაკვირვებების საგანძური, მოიცავდა ანატომიას, ბოტანიკას,
              გეოლოგიასა და ჰიდრავლიკას. მისი ხედვითი კონცეფციები ხშირად აჭარბებდა თავისი დროის ტექნოლოგიურ
              შესაძლებლობებს.

              მისი მხატვრული და მეცნიერული წვლილის გარდა, ლეონარდოს მახვილი დაკვირვებები გავრცელდა ბუნებრივ სამყაროზეც და
              დოკუმენტურად აღწერდა ფენომენებს წყლის ნაკადიდან ფრინველების ფრენამდე. მისი მემკვიდრეობა სცილდება
              დისციპლინებს, რაც სიმბოლოა ხელოვნებისა და მეცნიერების ურთიერთკავშირში. ლეონარდო და ვინჩის დაუოკებელი
              ცნობისმოყვარეობა და პიონერული სული კვლავ შთააგონებს თაობებს, აძლიერებს მის სტატუსს, როგორც ინტერდისციპლინური
              გენიოსის მაგალითს. იგი გარდაიცვალა 1519 წელს და დატოვა ღრმა და მუდმივი გავლენა ადამიანის შემოქმედებასა და
              კვლევაზე.
            </p>
          </div>
        </div>
      </div>
    </div>
    <Contact/>
    <!-- Div end -->
  </mainLayout>
</template>